Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/usb.h
#define USB_EP_STATUS_STALL_NAK_EP8_IN_MSB    _u(16)
#define USB_EP_STATUS_STALL_NAK_EP8_IN_LSB    _u(16)
#define USB_EP_STATUS_STALL_NAK_EP8_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP7_OUT
#define USB_EP_STATUS_STALL_NAK_EP7_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP7_OUT_BITS   _u(0x00008000)
#define USB_EP_STATUS_STALL_NAK_EP7_OUT_MSB    _u(15)
#define USB_EP_STATUS_STALL_NAK_EP7_OUT_LSB    _u(15)
#define USB_EP_STATUS_STALL_NAK_EP7_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP7_IN
#define USB_EP_STATUS_STALL_NAK_EP7_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP7_IN_BITS   _u(0x00004000)
#define USB_EP_STATUS_STALL_NAK_EP7_IN_MSB    _u(14)
#define USB_EP_STATUS_STALL_NAK_EP7_IN_LSB    _u(14)
#define USB_EP_STATUS_STALL_NAK_EP7_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP6_OUT
#define USB_EP_STATUS_STALL_NAK_EP6_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP6_OUT_BITS   _u(0x00002000)
#define USB_EP_STATUS_STALL_NAK_EP6_OUT_MSB    _u(13)
#define USB_EP_STATUS_STALL_NAK_EP6_OUT_LSB    _u(13)
#define USB_EP_STATUS_STALL_NAK_EP6_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP6_IN
#define USB_EP_STATUS_STALL_NAK_EP6_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP6_IN_BITS   _u(0x00001000)
#define USB_EP_STATUS_STALL_NAK_EP6_IN_MSB    _u(12)
#define USB_EP_STATUS_STALL_NAK_EP6_IN_LSB    _u(12)
#define USB_EP_STATUS_STALL_NAK_EP6_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP5_OUT
#define USB_EP_STATUS_STALL_NAK_EP5_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP5_OUT_BITS   _u(0x00000800)
#define USB_EP_STATUS_STALL_NAK_EP5_OUT_MSB    _u(11)
#define USB_EP_STATUS_STALL_NAK_EP5_OUT_LSB    _u(11)
#define USB_EP_STATUS_STALL_NAK_EP5_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP5_IN
#define USB_EP_STATUS_STALL_NAK_EP5_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP5_IN_BITS   _u(0x00000400)
#define USB_EP_STATUS_STALL_NAK_EP5_IN_MSB    _u(10)
#define USB_EP_STATUS_STALL_NAK_EP5_IN_LSB    _u(10)
#define USB_EP_STATUS_STALL_NAK_EP5_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP4_OUT
#define USB_EP_STATUS_STALL_NAK_EP4_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP4_OUT_BITS   _u(0x00000200)
#define USB_EP_STATUS_STALL_NAK_EP4_OUT_MSB    _u(9)
#define USB_EP_STATUS_STALL_NAK_EP4_OUT_LSB    _u(9)
#define USB_EP_STATUS_STALL_NAK_EP4_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP4_IN
#define USB_EP_STATUS_STALL_NAK_EP4_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP4_IN_BITS   _u(0x00000100)
#define USB_EP_STATUS_STALL_NAK_EP4_IN_MSB    _u(8)
#define USB_EP_STATUS_STALL_NAK_EP4_IN_LSB    _u(8)
#define USB_EP_STATUS_STALL_NAK_EP4_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP3_OUT
#define USB_EP_STATUS_STALL_NAK_EP3_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP3_OUT_BITS   _u(0x00000080)
#define USB_EP_STATUS_STALL_NAK_EP3_OUT_MSB    _u(7)
#define USB_EP_STATUS_STALL_NAK_EP3_OUT_LSB    _u(7)
#define USB_EP_STATUS_STALL_NAK_EP3_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP3_IN
#define USB_EP_STATUS_STALL_NAK_EP3_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP3_IN_BITS   _u(0x00000040)
#define USB_EP_STATUS_STALL_NAK_EP3_IN_MSB    _u(6)
#define USB_EP_STATUS_STALL_NAK_EP3_IN_LSB    _u(6)
#define USB_EP_STATUS_STALL_NAK_EP3_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP2_OUT
#define USB_EP_STATUS_STALL_NAK_EP2_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP2_OUT_BITS   _u(0x00000020)
#define USB_EP_STATUS_STALL_NAK_EP2_OUT_MSB    _u(5)
#define USB_EP_STATUS_STALL_NAK_EP2_OUT_LSB    _u(5)
#define USB_EP_STATUS_STALL_NAK_EP2_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP2_IN
#define USB_EP_STATUS_STALL_NAK_EP2_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP2_IN_BITS   _u(0x00000010)
#define USB_EP_STATUS_STALL_NAK_EP2_IN_MSB    _u(4)
#define USB_EP_STATUS_STALL_NAK_EP2_IN_LSB    _u(4)
#define USB_EP_STATUS_STALL_NAK_EP2_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP1_OUT
#define USB_EP_STATUS_STALL_NAK_EP1_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP1_OUT_BITS   _u(0x00000008)
#define USB_EP_STATUS_STALL_NAK_EP1_OUT_MSB    _u(3)
#define USB_EP_STATUS_STALL_NAK_EP1_OUT_LSB    _u(3)
#define USB_EP_STATUS_STALL_NAK_EP1_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP1_IN
#define USB_EP_STATUS_STALL_NAK_EP1_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP1_IN_BITS   _u(0x00000004)
#define USB_EP_STATUS_STALL_NAK_EP1_IN_MSB    _u(2)
#define USB_EP_STATUS_STALL_NAK_EP1_IN_LSB    _u(2)
#define USB_EP_STATUS_STALL_NAK_EP1_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP0_OUT
#define USB_EP_STATUS_STALL_NAK_EP0_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP0_OUT_BITS   _u(0x00000002)
#define USB_EP_STATUS_STALL_NAK_EP0_OUT_MSB    _u(1)
#define USB_EP_STATUS_STALL_NAK_EP0_OUT_LSB    _u(1)
#define USB_EP_STATUS_STALL_NAK_EP0_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP0_IN
#define USB_EP_STATUS_STALL_NAK_EP0_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP0_IN_BITS   _u(0x00000001)
#define USB_EP_STATUS_STALL_NAK_EP0_IN_MSB    _u(0)
#define USB_EP_STATUS_STALL_NAK_EP0_IN_LSB    _u(0)
#define USB_EP_STATUS_STALL_NAK_EP0_IN_ACCESS "WC"
// =============================================================================
// Register    : USB_USB_MUXING
// Description : Where to connect the USB controller. Should be to_phy by
//               default.
#define USB_USB_MUXING_OFFSET _u(0x00000074)
#define USB_USB_MUXING_BITS   _u(0x8000001f)
#define USB_USB_MUXING_RESET  _u(0x00000001)
// -----------------------------------------------------------------------------
// Field       : USB_USB_MUXING_SWAP_DPDM
// Description : Swap the USB PHY DP and DM pins and all related controls and
//               flip receive differential data. Can be used to switch USB DP/DP
//               on the PCB.
//               This is done at a low level so overrides all other controls.
#define USB_USB_MUXING_SWAP_DPDM_RESET  _u(0x0)
#define USB_USB_MUXING_SWAP_DPDM_BITS   _u(0x80000000)
#define USB_USB_MUXING_SWAP_DPDM_MSB    _u(31)
#define USB_USB_MUXING_SWAP_DPDM_LSB    _u(31)
#define USB_USB_MUXING_SWAP_DPDM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USB_MUXING_USBPHY_AS_GPIO
// Description : Use the usb DP and DM pins as GPIO pins instead of connecting
//               them to the USB controller.
#define USB_USB_MUXING_USBPHY_AS_GPIO_RESET  _u(0x0)
#define USB_USB_MUXING_USBPHY_AS_GPIO_BITS   _u(0x00000010)
#define USB_USB_MUXING_USBPHY_AS_GPIO_MSB    _u(4)
#define USB_USB_MUXING_USBPHY_AS_GPIO_LSB    _u(4)
#define USB_USB_MUXING_USBPHY_AS_GPIO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USB_MUXING_SOFTCON
#define USB_USB_MUXING_SOFTCON_RESET  _u(0x0)
#define USB_USB_MUXING_SOFTCON_BITS   _u(0x00000008)
#define USB_USB_MUXING_SOFTCON_MSB    _u(3)
#define USB_USB_MUXING_SOFTCON_LSB    _u(3)
#define USB_USB_MUXING_SOFTCON_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USB_MUXING_TO_DIGITAL_PAD
#define USB_USB_MUXING_TO_DIGITAL_PAD_RESET  _u(0x0)
#define USB_USB_MUXING_TO_DIGITAL_PAD_BITS   _u(0x00000004)
#define USB_USB_MUXING_TO_DIGITAL_PAD_MSB    _u(2)
#define USB_USB_MUXING_TO_DIGITAL_PAD_LSB    _u(2)
#define USB_USB_MUXING_TO_DIGITAL_PAD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USB_MUXING_TO_EXTPHY
#define USB_USB_MUXING_TO_EXTPHY_RESET  _u(0x0)
#define USB_USB_MUXING_TO_EXTPHY_BITS   _u(0x00000002)
#define USB_USB_MUXING_TO_EXTPHY_MSB    _u(1)
#define USB_USB_MUXING_TO_EXTPHY_LSB    _u(1)
#define USB_USB_MUXING_TO_EXTPHY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USB_MUXING_TO_PHY
#define USB_USB_MUXING_TO_PHY_RESET  _u(0x1)
#define USB_USB_MUXING_TO_PHY_BITS   _u(0x00000001)
#define USB_USB_MUXING_TO_PHY_MSB    _u(0)
#define USB_USB_MUXING_TO_PHY_LSB    _u(0)
#define USB_USB_MUXING_TO_PHY_ACCESS "RW"
// =============================================================================
// Register    : USB_USB_PWR
// Description : Overrides for the power signals in the event that the VBUS
//               signals are not hooked up to GPIO. Set the value of the
//               override and then the override enable to switch over to the
//               override value.
#define USB_USB_PWR_OFFSET _u(0x00000078)
#define USB_USB_PWR_BITS   _u(0x0000003f)
#define USB_USB_PWR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_USB_PWR_OVERCURR_DETECT_EN
#define USB_USB_PWR_OVERCURR_DETECT_EN_RESET  _u(0x0)
#define USB_USB_PWR_OVERCURR_DETECT_EN_BITS   _u(0x00000020)
#define USB_USB_PWR_OVERCURR_DETECT_EN_MSB    _u(5)
#define USB_USB_PWR_OVERCURR_DETECT_EN_LSB    _u(5)
#define USB_USB_PWR_OVERCURR_DETECT_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USB_PWR_OVERCURR_DETECT
#define USB_USB_PWR_OVERCURR_DETECT_RESET  _u(0x0)
#define USB_USB_PWR_OVERCURR_DETECT_BITS   _u(0x00000010)
#define USB_USB_PWR_OVERCURR_DETECT_MSB    _u(4)
#define USB_USB_PWR_OVERCURR_DETECT_LSB    _u(4)
#define USB_USB_PWR_OVERCURR_DETECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN
#define USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_RESET  _u(0x0)
#define USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_BITS   _u(0x00000008)
#define USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_MSB    _u(3)
#define USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_LSB    _u(3)
#define USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USB_PWR_VBUS_DETECT
#define USB_USB_PWR_VBUS_DETECT_RESET  _u(0x0)
#define USB_USB_PWR_VBUS_DETECT_BITS   _u(0x00000004)
#define USB_USB_PWR_VBUS_DETECT_MSB    _u(2)
#define USB_USB_PWR_VBUS_DETECT_LSB    _u(2)
#define USB_USB_PWR_VBUS_DETECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USB_PWR_VBUS_EN_OVERRIDE_EN
#define USB_USB_PWR_VBUS_EN_OVERRIDE_EN_RESET  _u(0x0)
#define USB_USB_PWR_VBUS_EN_OVERRIDE_EN_BITS   _u(0x00000002)
#define USB_USB_PWR_VBUS_EN_OVERRIDE_EN_MSB    _u(1)
#define USB_USB_PWR_VBUS_EN_OVERRIDE_EN_LSB    _u(1)
#define USB_USB_PWR_VBUS_EN_OVERRIDE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USB_PWR_VBUS_EN
#define USB_USB_PWR_VBUS_EN_RESET  _u(0x0)
#define USB_USB_PWR_VBUS_EN_BITS   _u(0x00000001)
#define USB_USB_PWR_VBUS_EN_MSB    _u(0)
#define USB_USB_PWR_VBUS_EN_LSB    _u(0)
#define USB_USB_PWR_VBUS_EN_ACCESS "RW"
// =============================================================================
// Register    : USB_USBPHY_DIRECT
// Description : This register allows for direct control of the USB phy. Use in
//               conjunction with usbphy_direct_override register to enable each
//               override bit.
#define USB_USBPHY_DIRECT_OFFSET _u(0x0000007c)
#define USB_USBPHY_DIRECT_BITS   _u(0x03ffff77)
#define USB_USBPHY_DIRECT_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_RX_DM_OVERRIDE
// Description : Override rx_dm value into controller
#define USB_USBPHY_DIRECT_RX_DM_OVERRIDE_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_RX_DM_OVERRIDE_BITS   _u(0x02000000)
#define USB_USBPHY_DIRECT_RX_DM_OVERRIDE_MSB    _u(25)
#define USB_USBPHY_DIRECT_RX_DM_OVERRIDE_LSB    _u(25)
#define USB_USBPHY_DIRECT_RX_DM_OVERRIDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_RX_DP_OVERRIDE
// Description : Override rx_dp value into controller
#define USB_USBPHY_DIRECT_RX_DP_OVERRIDE_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_RX_DP_OVERRIDE_BITS   _u(0x01000000)
#define USB_USBPHY_DIRECT_RX_DP_OVERRIDE_MSB    _u(24)
#define USB_USBPHY_DIRECT_RX_DP_OVERRIDE_LSB    _u(24)
#define USB_USBPHY_DIRECT_RX_DP_OVERRIDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_RX_DD_OVERRIDE
// Description : Override rx_dd value into controller
#define USB_USBPHY_DIRECT_RX_DD_OVERRIDE_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_RX_DD_OVERRIDE_BITS   _u(0x00800000)
#define USB_USBPHY_DIRECT_RX_DD_OVERRIDE_MSB    _u(23)
#define USB_USBPHY_DIRECT_RX_DD_OVERRIDE_LSB    _u(23)
#define USB_USBPHY_DIRECT_RX_DD_OVERRIDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_DM_OVV
// Description : DM over voltage
#define USB_USBPHY_DIRECT_DM_OVV_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_DM_OVV_BITS   _u(0x00400000)
#define USB_USBPHY_DIRECT_DM_OVV_MSB    _u(22)
#define USB_USBPHY_DIRECT_DM_OVV_LSB    _u(22)
#define USB_USBPHY_DIRECT_DM_OVV_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_DP_OVV
// Description : DP over voltage
#define USB_USBPHY_DIRECT_DP_OVV_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_DP_OVV_BITS   _u(0x00200000)
#define USB_USBPHY_DIRECT_DP_OVV_MSB    _u(21)
#define USB_USBPHY_DIRECT_DP_OVV_LSB    _u(21)
#define USB_USBPHY_DIRECT_DP_OVV_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_DM_OVCN
// Description : DM overcurrent
#define USB_USBPHY_DIRECT_DM_OVCN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_DM_OVCN_BITS   _u(0x00100000)
#define USB_USBPHY_DIRECT_DM_OVCN_MSB    _u(20)
#define USB_USBPHY_DIRECT_DM_OVCN_LSB    _u(20)
#define USB_USBPHY_DIRECT_DM_OVCN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_DP_OVCN
// Description : DP overcurrent
#define USB_USBPHY_DIRECT_DP_OVCN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_DP_OVCN_BITS   _u(0x00080000)
#define USB_USBPHY_DIRECT_DP_OVCN_MSB    _u(19)
#define USB_USBPHY_DIRECT_DP_OVCN_LSB    _u(19)
#define USB_USBPHY_DIRECT_DP_OVCN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_RX_DM
// Description : DPM pin state
#define USB_USBPHY_DIRECT_RX_DM_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_RX_DM_BITS   _u(0x00040000)
#define USB_USBPHY_DIRECT_RX_DM_MSB    _u(18)
#define USB_USBPHY_DIRECT_RX_DM_LSB    _u(18)
#define USB_USBPHY_DIRECT_RX_DM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_RX_DP
// Description : DPP pin state
#define USB_USBPHY_DIRECT_RX_DP_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_RX_DP_BITS   _u(0x00020000)
#define USB_USBPHY_DIRECT_RX_DP_MSB    _u(17)
#define USB_USBPHY_DIRECT_RX_DP_LSB    _u(17)
#define USB_USBPHY_DIRECT_RX_DP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_RX_DD
// Description : Differential RX
#define USB_USBPHY_DIRECT_RX_DD_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_RX_DD_BITS   _u(0x00010000)
#define USB_USBPHY_DIRECT_RX_DD_MSB    _u(16)
#define USB_USBPHY_DIRECT_RX_DD_LSB    _u(16)
#define USB_USBPHY_DIRECT_RX_DD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_TX_DIFFMODE
// Description : TX_DIFFMODE=0: Single ended mode
//               TX_DIFFMODE=1: Differential drive mode (TX_DM, TX_DM_OE
//               ignored)
#define USB_USBPHY_DIRECT_TX_DIFFMODE_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_TX_DIFFMODE_BITS   _u(0x00008000)
#define USB_USBPHY_DIRECT_TX_DIFFMODE_MSB    _u(15)
#define USB_USBPHY_DIRECT_TX_DIFFMODE_LSB    _u(15)
#define USB_USBPHY_DIRECT_TX_DIFFMODE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_TX_FSSLEW
// Description : TX_FSSLEW=0: Low speed slew rate
//               TX_FSSLEW=1: Full speed slew rate
#define USB_USBPHY_DIRECT_TX_FSSLEW_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_TX_FSSLEW_BITS   _u(0x00004000)
#define USB_USBPHY_DIRECT_TX_FSSLEW_MSB    _u(14)
#define USB_USBPHY_DIRECT_TX_FSSLEW_LSB    _u(14)
#define USB_USBPHY_DIRECT_TX_FSSLEW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_TX_PD
// Description : TX power down override (if override enable is set). 1 = powered
//               down.
#define USB_USBPHY_DIRECT_TX_PD_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_TX_PD_BITS   _u(0x00002000)
#define USB_USBPHY_DIRECT_TX_PD_MSB    _u(13)
#define USB_USBPHY_DIRECT_TX_PD_LSB    _u(13)
#define USB_USBPHY_DIRECT_TX_PD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_RX_PD
// Description : RX power down override (if override enable is set). 1 = powered
//               down.
#define USB_USBPHY_DIRECT_RX_PD_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_RX_PD_BITS   _u(0x00001000)
#define USB_USBPHY_DIRECT_RX_PD_MSB    _u(12)
#define USB_USBPHY_DIRECT_RX_PD_LSB    _u(12)
#define USB_USBPHY_DIRECT_RX_PD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_TX_DM
// Description : Output data. TX_DIFFMODE=1, Ignored
//               TX_DIFFMODE=0, Drives DPM only. TX_DM_OE=1 to enable drive.
//               DPM=TX_DM
#define USB_USBPHY_DIRECT_TX_DM_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_TX_DM_BITS   _u(0x00000800)
#define USB_USBPHY_DIRECT_TX_DM_MSB    _u(11)
#define USB_USBPHY_DIRECT_TX_DM_LSB    _u(11)
#define USB_USBPHY_DIRECT_TX_DM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_TX_DP
// Description : Output data. If TX_DIFFMODE=1, Drives DPP/DPM diff pair.
//               TX_DP_OE=1 to enable drive. DPP=TX_DP, DPM=~TX_DP
//               If TX_DIFFMODE=0, Drives DPP only. TX_DP_OE=1 to enable drive.
//               DPP=TX_DP
#define USB_USBPHY_DIRECT_TX_DP_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_TX_DP_BITS   _u(0x00000400)
#define USB_USBPHY_DIRECT_TX_DP_MSB    _u(10)
#define USB_USBPHY_DIRECT_TX_DP_LSB    _u(10)
#define USB_USBPHY_DIRECT_TX_DP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_TX_DM_OE
// Description : Output enable. If TX_DIFFMODE=1, Ignored.
//               If TX_DIFFMODE=0, OE for DPM only. 0 - DPM in Hi-Z state; 1 -
//               DPM driving
#define USB_USBPHY_DIRECT_TX_DM_OE_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_TX_DM_OE_BITS   _u(0x00000200)
#define USB_USBPHY_DIRECT_TX_DM_OE_MSB    _u(9)
#define USB_USBPHY_DIRECT_TX_DM_OE_LSB    _u(9)
#define USB_USBPHY_DIRECT_TX_DM_OE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_TX_DP_OE
// Description : Output enable. If TX_DIFFMODE=1, OE for DPP/DPM diff pair. 0 -
//               DPP/DPM in Hi-Z state; 1 - DPP/DPM driving
//               If TX_DIFFMODE=0, OE for DPP only. 0 - DPP in Hi-Z state; 1 -
//               DPP driving
#define USB_USBPHY_DIRECT_TX_DP_OE_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_TX_DP_OE_BITS   _u(0x00000100)
#define USB_USBPHY_DIRECT_TX_DP_OE_MSB    _u(8)
#define USB_USBPHY_DIRECT_TX_DP_OE_LSB    _u(8)
#define USB_USBPHY_DIRECT_TX_DP_OE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_DM_PULLDN_EN
// Description : DM pull down enable
#define USB_USBPHY_DIRECT_DM_PULLDN_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_DM_PULLDN_EN_BITS   _u(0x00000040)
#define USB_USBPHY_DIRECT_DM_PULLDN_EN_MSB    _u(6)
#define USB_USBPHY_DIRECT_DM_PULLDN_EN_LSB    _u(6)
#define USB_USBPHY_DIRECT_DM_PULLDN_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_DM_PULLUP_EN
// Description : DM pull up enable
#define USB_USBPHY_DIRECT_DM_PULLUP_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_DM_PULLUP_EN_BITS   _u(0x00000020)
#define USB_USBPHY_DIRECT_DM_PULLUP_EN_MSB    _u(5)
#define USB_USBPHY_DIRECT_DM_PULLUP_EN_LSB    _u(5)
#define USB_USBPHY_DIRECT_DM_PULLUP_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_DM_PULLUP_HISEL
// Description : Enable the second DM pull up resistor. 0 - Pull = Rpu2; 1 -
//               Pull = Rpu1 + Rpu2
#define USB_USBPHY_DIRECT_DM_PULLUP_HISEL_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_DM_PULLUP_HISEL_BITS   _u(0x00000010)
#define USB_USBPHY_DIRECT_DM_PULLUP_HISEL_MSB    _u(4)
#define USB_USBPHY_DIRECT_DM_PULLUP_HISEL_LSB    _u(4)
#define USB_USBPHY_DIRECT_DM_PULLUP_HISEL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_DP_PULLDN_EN
// Description : DP pull down enable
#define USB_USBPHY_DIRECT_DP_PULLDN_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_DP_PULLDN_EN_BITS   _u(0x00000004)
#define USB_USBPHY_DIRECT_DP_PULLDN_EN_MSB    _u(2)
#define USB_USBPHY_DIRECT_DP_PULLDN_EN_LSB    _u(2)
#define USB_USBPHY_DIRECT_DP_PULLDN_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_DP_PULLUP_EN
// Description : DP pull up enable
#define USB_USBPHY_DIRECT_DP_PULLUP_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_DP_PULLUP_EN_BITS   _u(0x00000002)
#define USB_USBPHY_DIRECT_DP_PULLUP_EN_MSB    _u(1)
#define USB_USBPHY_DIRECT_DP_PULLUP_EN_LSB    _u(1)
#define USB_USBPHY_DIRECT_DP_PULLUP_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_DP_PULLUP_HISEL
// Description : Enable the second DP pull up resistor. 0 - Pull = Rpu2; 1 -
//               Pull = Rpu1 + Rpu2
#define USB_USBPHY_DIRECT_DP_PULLUP_HISEL_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_DP_PULLUP_HISEL_BITS   _u(0x00000001)
#define USB_USBPHY_DIRECT_DP_PULLUP_HISEL_MSB    _u(0)
#define USB_USBPHY_DIRECT_DP_PULLUP_HISEL_LSB    _u(0)
