Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/usb.h
#define USB_INTR_ERROR_RX_TIMEOUT_LSB    _u(6)
#define USB_INTR_ERROR_RX_TIMEOUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_ERROR_DATA_SEQ
// Description : Source: SIE_STATUS.DATA_SEQ_ERROR
#define USB_INTR_ERROR_DATA_SEQ_RESET  _u(0x0)
#define USB_INTR_ERROR_DATA_SEQ_BITS   _u(0x00000020)
#define USB_INTR_ERROR_DATA_SEQ_MSB    _u(5)
#define USB_INTR_ERROR_DATA_SEQ_LSB    _u(5)
#define USB_INTR_ERROR_DATA_SEQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_BUFF_STATUS
// Description : Raised when any bit in BUFF_STATUS is set. Clear by clearing
//               all bits in BUFF_STATUS.
#define USB_INTR_BUFF_STATUS_RESET  _u(0x0)
#define USB_INTR_BUFF_STATUS_BITS   _u(0x00000010)
#define USB_INTR_BUFF_STATUS_MSB    _u(4)
#define USB_INTR_BUFF_STATUS_LSB    _u(4)
#define USB_INTR_BUFF_STATUS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_TRANS_COMPLETE
// Description : Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
//               writing to this bit.
#define USB_INTR_TRANS_COMPLETE_RESET  _u(0x0)
#define USB_INTR_TRANS_COMPLETE_BITS   _u(0x00000008)
#define USB_INTR_TRANS_COMPLETE_MSB    _u(3)
#define USB_INTR_TRANS_COMPLETE_LSB    _u(3)
#define USB_INTR_TRANS_COMPLETE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_HOST_SOF
// Description : Host: raised every time the host sends a SOF (Start of Frame).
//               Cleared by reading SOF_RD
#define USB_INTR_HOST_SOF_RESET  _u(0x0)
#define USB_INTR_HOST_SOF_BITS   _u(0x00000004)
#define USB_INTR_HOST_SOF_MSB    _u(2)
#define USB_INTR_HOST_SOF_LSB    _u(2)
#define USB_INTR_HOST_SOF_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_HOST_RESUME
// Description : Host: raised when a device wakes up the host. Cleared by
//               writing to SIE_STATUS.RESUME
#define USB_INTR_HOST_RESUME_RESET  _u(0x0)
#define USB_INTR_HOST_RESUME_BITS   _u(0x00000002)
#define USB_INTR_HOST_RESUME_MSB    _u(1)
#define USB_INTR_HOST_RESUME_LSB    _u(1)
#define USB_INTR_HOST_RESUME_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_HOST_CONN_DIS
// Description : Host: raised when a device is connected or disconnected (i.e.
//               when SIE_STATUS.SPEED changes). Cleared by writing to
//               SIE_STATUS.SPEED
#define USB_INTR_HOST_CONN_DIS_RESET  _u(0x0)
#define USB_INTR_HOST_CONN_DIS_BITS   _u(0x00000001)
#define USB_INTR_HOST_CONN_DIS_MSB    _u(0)
#define USB_INTR_HOST_CONN_DIS_LSB    _u(0)
#define USB_INTR_HOST_CONN_DIS_ACCESS "RO"
// =============================================================================
// Register    : USB_INTE
// Description : Interrupt Enable
#define USB_INTE_OFFSET _u(0x00000090)
#define USB_INTE_BITS   _u(0x00ffffff)
#define USB_INTE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_INTE_EPX_STOPPED_ON_NAK
// Description : Source: NAK_POLL.EPX_STOPPED_ON_NAK
#define USB_INTE_EPX_STOPPED_ON_NAK_RESET  _u(0x0)
#define USB_INTE_EPX_STOPPED_ON_NAK_BITS   _u(0x00800000)
#define USB_INTE_EPX_STOPPED_ON_NAK_MSB    _u(23)
#define USB_INTE_EPX_STOPPED_ON_NAK_LSB    _u(23)
#define USB_INTE_EPX_STOPPED_ON_NAK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_DEV_SM_WATCHDOG_FIRED
// Description : Source: DEV_SM_WATCHDOG.FIRED
#define USB_INTE_DEV_SM_WATCHDOG_FIRED_RESET  _u(0x0)
#define USB_INTE_DEV_SM_WATCHDOG_FIRED_BITS   _u(0x00400000)
#define USB_INTE_DEV_SM_WATCHDOG_FIRED_MSB    _u(22)
#define USB_INTE_DEV_SM_WATCHDOG_FIRED_LSB    _u(22)
#define USB_INTE_DEV_SM_WATCHDOG_FIRED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ENDPOINT_ERROR
// Description : Source: SIE_STATUS.ENDPOINT_ERROR
#define USB_INTE_ENDPOINT_ERROR_RESET  _u(0x0)
#define USB_INTE_ENDPOINT_ERROR_BITS   _u(0x00200000)
#define USB_INTE_ENDPOINT_ERROR_MSB    _u(21)
#define USB_INTE_ENDPOINT_ERROR_LSB    _u(21)
#define USB_INTE_ENDPOINT_ERROR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_RX_SHORT_PACKET
// Description : Source: SIE_STATUS.RX_SHORT_PACKET
#define USB_INTE_RX_SHORT_PACKET_RESET  _u(0x0)
#define USB_INTE_RX_SHORT_PACKET_BITS   _u(0x00100000)
#define USB_INTE_RX_SHORT_PACKET_MSB    _u(20)
#define USB_INTE_RX_SHORT_PACKET_LSB    _u(20)
#define USB_INTE_RX_SHORT_PACKET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_EP_STALL_NAK
// Description : Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by
//               clearing all bits in EP_STATUS_STALL_NAK.
#define USB_INTE_EP_STALL_NAK_RESET  _u(0x0)
#define USB_INTE_EP_STALL_NAK_BITS   _u(0x00080000)
#define USB_INTE_EP_STALL_NAK_MSB    _u(19)
#define USB_INTE_EP_STALL_NAK_LSB    _u(19)
#define USB_INTE_EP_STALL_NAK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ABORT_DONE
// Description : Raised when any bit in ABORT_DONE is set. Clear by clearing all
//               bits in ABORT_DONE.
#define USB_INTE_ABORT_DONE_RESET  _u(0x0)
#define USB_INTE_ABORT_DONE_BITS   _u(0x00040000)
#define USB_INTE_ABORT_DONE_MSB    _u(18)
#define USB_INTE_ABORT_DONE_LSB    _u(18)
#define USB_INTE_ABORT_DONE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_DEV_SOF
// Description : Set every time the device receives a SOF (Start of Frame)
//               packet. Cleared by reading SOF_RD
#define USB_INTE_DEV_SOF_RESET  _u(0x0)
#define USB_INTE_DEV_SOF_BITS   _u(0x00020000)
#define USB_INTE_DEV_SOF_MSB    _u(17)
#define USB_INTE_DEV_SOF_LSB    _u(17)
#define USB_INTE_DEV_SOF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_SETUP_REQ
// Description : Device. Source: SIE_STATUS.SETUP_REC
#define USB_INTE_SETUP_REQ_RESET  _u(0x0)
#define USB_INTE_SETUP_REQ_BITS   _u(0x00010000)
#define USB_INTE_SETUP_REQ_MSB    _u(16)
#define USB_INTE_SETUP_REQ_LSB    _u(16)
#define USB_INTE_SETUP_REQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_DEV_RESUME_FROM_HOST
// Description : Set when the device receives a resume from the host. Cleared by
//               writing to SIE_STATUS.RESUME
#define USB_INTE_DEV_RESUME_FROM_HOST_RESET  _u(0x0)
#define USB_INTE_DEV_RESUME_FROM_HOST_BITS   _u(0x00008000)
#define USB_INTE_DEV_RESUME_FROM_HOST_MSB    _u(15)
#define USB_INTE_DEV_RESUME_FROM_HOST_LSB    _u(15)
#define USB_INTE_DEV_RESUME_FROM_HOST_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_DEV_SUSPEND
// Description : Set when the device suspend state changes. Cleared by writing
//               to SIE_STATUS.SUSPENDED
#define USB_INTE_DEV_SUSPEND_RESET  _u(0x0)
#define USB_INTE_DEV_SUSPEND_BITS   _u(0x00004000)
#define USB_INTE_DEV_SUSPEND_MSB    _u(14)
#define USB_INTE_DEV_SUSPEND_LSB    _u(14)
#define USB_INTE_DEV_SUSPEND_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_DEV_CONN_DIS
// Description : Set when the device connection state changes. Cleared by
//               writing to SIE_STATUS.CONNECTED
#define USB_INTE_DEV_CONN_DIS_RESET  _u(0x0)
#define USB_INTE_DEV_CONN_DIS_BITS   _u(0x00002000)
#define USB_INTE_DEV_CONN_DIS_MSB    _u(13)
#define USB_INTE_DEV_CONN_DIS_LSB    _u(13)
#define USB_INTE_DEV_CONN_DIS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_BUS_RESET
// Description : Source: SIE_STATUS.BUS_RESET
#define USB_INTE_BUS_RESET_RESET  _u(0x0)
#define USB_INTE_BUS_RESET_BITS   _u(0x00001000)
#define USB_INTE_BUS_RESET_MSB    _u(12)
#define USB_INTE_BUS_RESET_LSB    _u(12)
#define USB_INTE_BUS_RESET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_VBUS_DETECT
// Description : Source: SIE_STATUS.VBUS_DETECTED
#define USB_INTE_VBUS_DETECT_RESET  _u(0x0)
#define USB_INTE_VBUS_DETECT_BITS   _u(0x00000800)
#define USB_INTE_VBUS_DETECT_MSB    _u(11)
#define USB_INTE_VBUS_DETECT_LSB    _u(11)
#define USB_INTE_VBUS_DETECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_STALL
// Description : Source: SIE_STATUS.STALL_REC
#define USB_INTE_STALL_RESET  _u(0x0)
#define USB_INTE_STALL_BITS   _u(0x00000400)
#define USB_INTE_STALL_MSB    _u(10)
#define USB_INTE_STALL_LSB    _u(10)
#define USB_INTE_STALL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ERROR_CRC
// Description : Source: SIE_STATUS.CRC_ERROR
#define USB_INTE_ERROR_CRC_RESET  _u(0x0)
#define USB_INTE_ERROR_CRC_BITS   _u(0x00000200)
#define USB_INTE_ERROR_CRC_MSB    _u(9)
#define USB_INTE_ERROR_CRC_LSB    _u(9)
#define USB_INTE_ERROR_CRC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ERROR_BIT_STUFF
// Description : Source: SIE_STATUS.BIT_STUFF_ERROR
#define USB_INTE_ERROR_BIT_STUFF_RESET  _u(0x0)
#define USB_INTE_ERROR_BIT_STUFF_BITS   _u(0x00000100)
#define USB_INTE_ERROR_BIT_STUFF_MSB    _u(8)
#define USB_INTE_ERROR_BIT_STUFF_LSB    _u(8)
#define USB_INTE_ERROR_BIT_STUFF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ERROR_RX_OVERFLOW
// Description : Source: SIE_STATUS.RX_OVERFLOW
#define USB_INTE_ERROR_RX_OVERFLOW_RESET  _u(0x0)
#define USB_INTE_ERROR_RX_OVERFLOW_BITS   _u(0x00000080)
#define USB_INTE_ERROR_RX_OVERFLOW_MSB    _u(7)
#define USB_INTE_ERROR_RX_OVERFLOW_LSB    _u(7)
#define USB_INTE_ERROR_RX_OVERFLOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ERROR_RX_TIMEOUT
// Description : Source: SIE_STATUS.RX_TIMEOUT
#define USB_INTE_ERROR_RX_TIMEOUT_RESET  _u(0x0)
#define USB_INTE_ERROR_RX_TIMEOUT_BITS   _u(0x00000040)
#define USB_INTE_ERROR_RX_TIMEOUT_MSB    _u(6)
#define USB_INTE_ERROR_RX_TIMEOUT_LSB    _u(6)
#define USB_INTE_ERROR_RX_TIMEOUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ERROR_DATA_SEQ
// Description : Source: SIE_STATUS.DATA_SEQ_ERROR
#define USB_INTE_ERROR_DATA_SEQ_RESET  _u(0x0)
#define USB_INTE_ERROR_DATA_SEQ_BITS   _u(0x00000020)
#define USB_INTE_ERROR_DATA_SEQ_MSB    _u(5)
#define USB_INTE_ERROR_DATA_SEQ_LSB    _u(5)
#define USB_INTE_ERROR_DATA_SEQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_BUFF_STATUS
// Description : Raised when any bit in BUFF_STATUS is set. Clear by clearing
//               all bits in BUFF_STATUS.
#define USB_INTE_BUFF_STATUS_RESET  _u(0x0)
#define USB_INTE_BUFF_STATUS_BITS   _u(0x00000010)
#define USB_INTE_BUFF_STATUS_MSB    _u(4)
#define USB_INTE_BUFF_STATUS_LSB    _u(4)
#define USB_INTE_BUFF_STATUS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_TRANS_COMPLETE
// Description : Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
//               writing to this bit.
#define USB_INTE_TRANS_COMPLETE_RESET  _u(0x0)
#define USB_INTE_TRANS_COMPLETE_BITS   _u(0x00000008)
#define USB_INTE_TRANS_COMPLETE_MSB    _u(3)
#define USB_INTE_TRANS_COMPLETE_LSB    _u(3)
#define USB_INTE_TRANS_COMPLETE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_HOST_SOF
// Description : Host: raised every time the host sends a SOF (Start of Frame).
//               Cleared by reading SOF_RD
#define USB_INTE_HOST_SOF_RESET  _u(0x0)
#define USB_INTE_HOST_SOF_BITS   _u(0x00000004)
#define USB_INTE_HOST_SOF_MSB    _u(2)
#define USB_INTE_HOST_SOF_LSB    _u(2)
#define USB_INTE_HOST_SOF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_HOST_RESUME
// Description : Host: raised when a device wakes up the host. Cleared by
//               writing to SIE_STATUS.RESUME
#define USB_INTE_HOST_RESUME_RESET  _u(0x0)
#define USB_INTE_HOST_RESUME_BITS   _u(0x00000002)
#define USB_INTE_HOST_RESUME_MSB    _u(1)
#define USB_INTE_HOST_RESUME_LSB    _u(1)
#define USB_INTE_HOST_RESUME_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_HOST_CONN_DIS
// Description : Host: raised when a device is connected or disconnected (i.e.
//               when SIE_STATUS.SPEED changes). Cleared by writing to
//               SIE_STATUS.SPEED
#define USB_INTE_HOST_CONN_DIS_RESET  _u(0x0)
#define USB_INTE_HOST_CONN_DIS_BITS   _u(0x00000001)
#define USB_INTE_HOST_CONN_DIS_MSB    _u(0)
#define USB_INTE_HOST_CONN_DIS_LSB    _u(0)
#define USB_INTE_HOST_CONN_DIS_ACCESS "RW"
// =============================================================================
// Register    : USB_INTF
// Description : Interrupt Force
#define USB_INTF_OFFSET _u(0x00000094)
#define USB_INTF_BITS   _u(0x00ffffff)
#define USB_INTF_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_INTF_EPX_STOPPED_ON_NAK
// Description : Source: NAK_POLL.EPX_STOPPED_ON_NAK
#define USB_INTF_EPX_STOPPED_ON_NAK_RESET  _u(0x0)
#define USB_INTF_EPX_STOPPED_ON_NAK_BITS   _u(0x00800000)
#define USB_INTF_EPX_STOPPED_ON_NAK_MSB    _u(23)
#define USB_INTF_EPX_STOPPED_ON_NAK_LSB    _u(23)
#define USB_INTF_EPX_STOPPED_ON_NAK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_DEV_SM_WATCHDOG_FIRED
// Description : Source: DEV_SM_WATCHDOG.FIRED
#define USB_INTF_DEV_SM_WATCHDOG_FIRED_RESET  _u(0x0)
#define USB_INTF_DEV_SM_WATCHDOG_FIRED_BITS   _u(0x00400000)
#define USB_INTF_DEV_SM_WATCHDOG_FIRED_MSB    _u(22)
#define USB_INTF_DEV_SM_WATCHDOG_FIRED_LSB    _u(22)
#define USB_INTF_DEV_SM_WATCHDOG_FIRED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_ENDPOINT_ERROR
// Description : Source: SIE_STATUS.ENDPOINT_ERROR
#define USB_INTF_ENDPOINT_ERROR_RESET  _u(0x0)
#define USB_INTF_ENDPOINT_ERROR_BITS   _u(0x00200000)
#define USB_INTF_ENDPOINT_ERROR_MSB    _u(21)
#define USB_INTF_ENDPOINT_ERROR_LSB    _u(21)
#define USB_INTF_ENDPOINT_ERROR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_RX_SHORT_PACKET
// Description : Source: SIE_STATUS.RX_SHORT_PACKET
#define USB_INTF_RX_SHORT_PACKET_RESET  _u(0x0)
#define USB_INTF_RX_SHORT_PACKET_BITS   _u(0x00100000)
#define USB_INTF_RX_SHORT_PACKET_MSB    _u(20)
#define USB_INTF_RX_SHORT_PACKET_LSB    _u(20)
#define USB_INTF_RX_SHORT_PACKET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_EP_STALL_NAK
// Description : Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by
//               clearing all bits in EP_STATUS_STALL_NAK.
#define USB_INTF_EP_STALL_NAK_RESET  _u(0x0)
#define USB_INTF_EP_STALL_NAK_BITS   _u(0x00080000)
#define USB_INTF_EP_STALL_NAK_MSB    _u(19)
#define USB_INTF_EP_STALL_NAK_LSB    _u(19)
#define USB_INTF_EP_STALL_NAK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_ABORT_DONE
// Description : Raised when any bit in ABORT_DONE is set. Clear by clearing all
//               bits in ABORT_DONE.
#define USB_INTF_ABORT_DONE_RESET  _u(0x0)
#define USB_INTF_ABORT_DONE_BITS   _u(0x00040000)
#define USB_INTF_ABORT_DONE_MSB    _u(18)
#define USB_INTF_ABORT_DONE_LSB    _u(18)
#define USB_INTF_ABORT_DONE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_DEV_SOF
// Description : Set every time the device receives a SOF (Start of Frame)
//               packet. Cleared by reading SOF_RD
#define USB_INTF_DEV_SOF_RESET  _u(0x0)
#define USB_INTF_DEV_SOF_BITS   _u(0x00020000)
#define USB_INTF_DEV_SOF_MSB    _u(17)
#define USB_INTF_DEV_SOF_LSB    _u(17)
#define USB_INTF_DEV_SOF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_SETUP_REQ
// Description : Device. Source: SIE_STATUS.SETUP_REC
#define USB_INTF_SETUP_REQ_RESET  _u(0x0)
#define USB_INTF_SETUP_REQ_BITS   _u(0x00010000)
#define USB_INTF_SETUP_REQ_MSB    _u(16)
#define USB_INTF_SETUP_REQ_LSB    _u(16)
#define USB_INTF_SETUP_REQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_DEV_RESUME_FROM_HOST
// Description : Set when the device receives a resume from the host. Cleared by
//               writing to SIE_STATUS.RESUME
#define USB_INTF_DEV_RESUME_FROM_HOST_RESET  _u(0x0)
#define USB_INTF_DEV_RESUME_FROM_HOST_BITS   _u(0x00008000)
#define USB_INTF_DEV_RESUME_FROM_HOST_MSB    _u(15)
#define USB_INTF_DEV_RESUME_FROM_HOST_LSB    _u(15)
#define USB_INTF_DEV_RESUME_FROM_HOST_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_DEV_SUSPEND
// Description : Set when the device suspend state changes. Cleared by writing
//               to SIE_STATUS.SUSPENDED
#define USB_INTF_DEV_SUSPEND_RESET  _u(0x0)
#define USB_INTF_DEV_SUSPEND_BITS   _u(0x00004000)
#define USB_INTF_DEV_SUSPEND_MSB    _u(14)
#define USB_INTF_DEV_SUSPEND_LSB    _u(14)
#define USB_INTF_DEV_SUSPEND_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_DEV_CONN_DIS
// Description : Set when the device connection state changes. Cleared by
//               writing to SIE_STATUS.CONNECTED
#define USB_INTF_DEV_CONN_DIS_RESET  _u(0x0)
#define USB_INTF_DEV_CONN_DIS_BITS   _u(0x00002000)
#define USB_INTF_DEV_CONN_DIS_MSB    _u(13)
#define USB_INTF_DEV_CONN_DIS_LSB    _u(13)
#define USB_INTF_DEV_CONN_DIS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_BUS_RESET
// Description : Source: SIE_STATUS.BUS_RESET
#define USB_INTF_BUS_RESET_RESET  _u(0x0)
#define USB_INTF_BUS_RESET_BITS   _u(0x00001000)
#define USB_INTF_BUS_RESET_MSB    _u(12)
#define USB_INTF_BUS_RESET_LSB    _u(12)
#define USB_INTF_BUS_RESET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_VBUS_DETECT
// Description : Source: SIE_STATUS.VBUS_DETECTED
#define USB_INTF_VBUS_DETECT_RESET  _u(0x0)
#define USB_INTF_VBUS_DETECT_BITS   _u(0x00000800)
#define USB_INTF_VBUS_DETECT_MSB    _u(11)
#define USB_INTF_VBUS_DETECT_LSB    _u(11)
#define USB_INTF_VBUS_DETECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_STALL
// Description : Source: SIE_STATUS.STALL_REC
#define USB_INTF_STALL_RESET  _u(0x0)
#define USB_INTF_STALL_BITS   _u(0x00000400)
#define USB_INTF_STALL_MSB    _u(10)
#define USB_INTF_STALL_LSB    _u(10)
#define USB_INTF_STALL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_ERROR_CRC
// Description : Source: SIE_STATUS.CRC_ERROR
#define USB_INTF_ERROR_CRC_RESET  _u(0x0)
#define USB_INTF_ERROR_CRC_BITS   _u(0x00000200)
#define USB_INTF_ERROR_CRC_MSB    _u(9)
#define USB_INTF_ERROR_CRC_LSB    _u(9)
#define USB_INTF_ERROR_CRC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_ERROR_BIT_STUFF
// Description : Source: SIE_STATUS.BIT_STUFF_ERROR
#define USB_INTF_ERROR_BIT_STUFF_RESET  _u(0x0)
#define USB_INTF_ERROR_BIT_STUFF_BITS   _u(0x00000100)
#define USB_INTF_ERROR_BIT_STUFF_MSB    _u(8)
#define USB_INTF_ERROR_BIT_STUFF_LSB    _u(8)
#define USB_INTF_ERROR_BIT_STUFF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_ERROR_RX_OVERFLOW
// Description : Source: SIE_STATUS.RX_OVERFLOW
#define USB_INTF_ERROR_RX_OVERFLOW_RESET  _u(0x0)
#define USB_INTF_ERROR_RX_OVERFLOW_BITS   _u(0x00000080)
#define USB_INTF_ERROR_RX_OVERFLOW_MSB    _u(7)
#define USB_INTF_ERROR_RX_OVERFLOW_LSB    _u(7)
#define USB_INTF_ERROR_RX_OVERFLOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_ERROR_RX_TIMEOUT
// Description : Source: SIE_STATUS.RX_TIMEOUT
#define USB_INTF_ERROR_RX_TIMEOUT_RESET  _u(0x0)
#define USB_INTF_ERROR_RX_TIMEOUT_BITS   _u(0x00000040)
#define USB_INTF_ERROR_RX_TIMEOUT_MSB    _u(6)
#define USB_INTF_ERROR_RX_TIMEOUT_LSB    _u(6)
#define USB_INTF_ERROR_RX_TIMEOUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_ERROR_DATA_SEQ
// Description : Source: SIE_STATUS.DATA_SEQ_ERROR
#define USB_INTF_ERROR_DATA_SEQ_RESET  _u(0x0)
#define USB_INTF_ERROR_DATA_SEQ_BITS   _u(0x00000020)
#define USB_INTF_ERROR_DATA_SEQ_MSB    _u(5)
#define USB_INTF_ERROR_DATA_SEQ_LSB    _u(5)
#define USB_INTF_ERROR_DATA_SEQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_BUFF_STATUS
// Description : Raised when any bit in BUFF_STATUS is set. Clear by clearing
//               all bits in BUFF_STATUS.
#define USB_INTF_BUFF_STATUS_RESET  _u(0x0)
#define USB_INTF_BUFF_STATUS_BITS   _u(0x00000010)
#define USB_INTF_BUFF_STATUS_MSB    _u(4)
#define USB_INTF_BUFF_STATUS_LSB    _u(4)
#define USB_INTF_BUFF_STATUS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_TRANS_COMPLETE
// Description : Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
//               writing to this bit.
#define USB_INTF_TRANS_COMPLETE_RESET  _u(0x0)
#define USB_INTF_TRANS_COMPLETE_BITS   _u(0x00000008)
#define USB_INTF_TRANS_COMPLETE_MSB    _u(3)
#define USB_INTF_TRANS_COMPLETE_LSB    _u(3)
#define USB_INTF_TRANS_COMPLETE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_HOST_SOF
// Description : Host: raised every time the host sends a SOF (Start of Frame).
//               Cleared by reading SOF_RD
#define USB_INTF_HOST_SOF_RESET  _u(0x0)
#define USB_INTF_HOST_SOF_BITS   _u(0x00000004)
#define USB_INTF_HOST_SOF_MSB    _u(2)
#define USB_INTF_HOST_SOF_LSB    _u(2)
#define USB_INTF_HOST_SOF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_HOST_RESUME
// Description : Host: raised when a device wakes up the host. Cleared by
//               writing to SIE_STATUS.RESUME
#define USB_INTF_HOST_RESUME_RESET  _u(0x0)
#define USB_INTF_HOST_RESUME_BITS   _u(0x00000002)
#define USB_INTF_HOST_RESUME_MSB    _u(1)
#define USB_INTF_HOST_RESUME_LSB    _u(1)
#define USB_INTF_HOST_RESUME_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTF_HOST_CONN_DIS
// Description : Host: raised when a device is connected or disconnected (i.e.
