Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/usb.h
//               when SIE_STATUS.SPEED changes). Cleared by writing to
//               SIE_STATUS.SPEED
#define USB_INTF_HOST_CONN_DIS_RESET  _u(0x0)
#define USB_INTF_HOST_CONN_DIS_BITS   _u(0x00000001)
#define USB_INTF_HOST_CONN_DIS_MSB    _u(0)
#define USB_INTF_HOST_CONN_DIS_LSB    _u(0)
#define USB_INTF_HOST_CONN_DIS_ACCESS "RW"
// =============================================================================
// Register    : USB_INTS
// Description : Interrupt status after masking & forcing
#define USB_INTS_OFFSET _u(0x00000098)
#define USB_INTS_BITS   _u(0x00ffffff)
#define USB_INTS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_INTS_EPX_STOPPED_ON_NAK
// Description : Source: NAK_POLL.EPX_STOPPED_ON_NAK
#define USB_INTS_EPX_STOPPED_ON_NAK_RESET  _u(0x0)
#define USB_INTS_EPX_STOPPED_ON_NAK_BITS   _u(0x00800000)
#define USB_INTS_EPX_STOPPED_ON_NAK_MSB    _u(23)
#define USB_INTS_EPX_STOPPED_ON_NAK_LSB    _u(23)
#define USB_INTS_EPX_STOPPED_ON_NAK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_DEV_SM_WATCHDOG_FIRED
// Description : Source: DEV_SM_WATCHDOG.FIRED
#define USB_INTS_DEV_SM_WATCHDOG_FIRED_RESET  _u(0x0)
#define USB_INTS_DEV_SM_WATCHDOG_FIRED_BITS   _u(0x00400000)
#define USB_INTS_DEV_SM_WATCHDOG_FIRED_MSB    _u(22)
#define USB_INTS_DEV_SM_WATCHDOG_FIRED_LSB    _u(22)
#define USB_INTS_DEV_SM_WATCHDOG_FIRED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_ENDPOINT_ERROR
// Description : Source: SIE_STATUS.ENDPOINT_ERROR
#define USB_INTS_ENDPOINT_ERROR_RESET  _u(0x0)
#define USB_INTS_ENDPOINT_ERROR_BITS   _u(0x00200000)
#define USB_INTS_ENDPOINT_ERROR_MSB    _u(21)
#define USB_INTS_ENDPOINT_ERROR_LSB    _u(21)
#define USB_INTS_ENDPOINT_ERROR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_RX_SHORT_PACKET
// Description : Source: SIE_STATUS.RX_SHORT_PACKET
#define USB_INTS_RX_SHORT_PACKET_RESET  _u(0x0)
#define USB_INTS_RX_SHORT_PACKET_BITS   _u(0x00100000)
#define USB_INTS_RX_SHORT_PACKET_MSB    _u(20)
#define USB_INTS_RX_SHORT_PACKET_LSB    _u(20)
#define USB_INTS_RX_SHORT_PACKET_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_EP_STALL_NAK
// Description : Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by
//               clearing all bits in EP_STATUS_STALL_NAK.
#define USB_INTS_EP_STALL_NAK_RESET  _u(0x0)
#define USB_INTS_EP_STALL_NAK_BITS   _u(0x00080000)
#define USB_INTS_EP_STALL_NAK_MSB    _u(19)
#define USB_INTS_EP_STALL_NAK_LSB    _u(19)
#define USB_INTS_EP_STALL_NAK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_ABORT_DONE
// Description : Raised when any bit in ABORT_DONE is set. Clear by clearing all
//               bits in ABORT_DONE.
#define USB_INTS_ABORT_DONE_RESET  _u(0x0)
#define USB_INTS_ABORT_DONE_BITS   _u(0x00040000)
#define USB_INTS_ABORT_DONE_MSB    _u(18)
#define USB_INTS_ABORT_DONE_LSB    _u(18)
#define USB_INTS_ABORT_DONE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_DEV_SOF
// Description : Set every time the device receives a SOF (Start of Frame)
//               packet. Cleared by reading SOF_RD
#define USB_INTS_DEV_SOF_RESET  _u(0x0)
#define USB_INTS_DEV_SOF_BITS   _u(0x00020000)
#define USB_INTS_DEV_SOF_MSB    _u(17)
#define USB_INTS_DEV_SOF_LSB    _u(17)
#define USB_INTS_DEV_SOF_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_SETUP_REQ
// Description : Device. Source: SIE_STATUS.SETUP_REC
#define USB_INTS_SETUP_REQ_RESET  _u(0x0)
#define USB_INTS_SETUP_REQ_BITS   _u(0x00010000)
#define USB_INTS_SETUP_REQ_MSB    _u(16)
#define USB_INTS_SETUP_REQ_LSB    _u(16)
#define USB_INTS_SETUP_REQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_DEV_RESUME_FROM_HOST
// Description : Set when the device receives a resume from the host. Cleared by
//               writing to SIE_STATUS.RESUME
#define USB_INTS_DEV_RESUME_FROM_HOST_RESET  _u(0x0)
#define USB_INTS_DEV_RESUME_FROM_HOST_BITS   _u(0x00008000)
#define USB_INTS_DEV_RESUME_FROM_HOST_MSB    _u(15)
#define USB_INTS_DEV_RESUME_FROM_HOST_LSB    _u(15)
#define USB_INTS_DEV_RESUME_FROM_HOST_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_DEV_SUSPEND
// Description : Set when the device suspend state changes. Cleared by writing
//               to SIE_STATUS.SUSPENDED
#define USB_INTS_DEV_SUSPEND_RESET  _u(0x0)
#define USB_INTS_DEV_SUSPEND_BITS   _u(0x00004000)
#define USB_INTS_DEV_SUSPEND_MSB    _u(14)
#define USB_INTS_DEV_SUSPEND_LSB    _u(14)
#define USB_INTS_DEV_SUSPEND_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_DEV_CONN_DIS
// Description : Set when the device connection state changes. Cleared by
//               writing to SIE_STATUS.CONNECTED
#define USB_INTS_DEV_CONN_DIS_RESET  _u(0x0)
#define USB_INTS_DEV_CONN_DIS_BITS   _u(0x00002000)
#define USB_INTS_DEV_CONN_DIS_MSB    _u(13)
#define USB_INTS_DEV_CONN_DIS_LSB    _u(13)
#define USB_INTS_DEV_CONN_DIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_BUS_RESET
// Description : Source: SIE_STATUS.BUS_RESET
#define USB_INTS_BUS_RESET_RESET  _u(0x0)
#define USB_INTS_BUS_RESET_BITS   _u(0x00001000)
#define USB_INTS_BUS_RESET_MSB    _u(12)
#define USB_INTS_BUS_RESET_LSB    _u(12)
#define USB_INTS_BUS_RESET_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_VBUS_DETECT
// Description : Source: SIE_STATUS.VBUS_DETECTED
#define USB_INTS_VBUS_DETECT_RESET  _u(0x0)
#define USB_INTS_VBUS_DETECT_BITS   _u(0x00000800)
#define USB_INTS_VBUS_DETECT_MSB    _u(11)
#define USB_INTS_VBUS_DETECT_LSB    _u(11)
#define USB_INTS_VBUS_DETECT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_STALL
// Description : Source: SIE_STATUS.STALL_REC
#define USB_INTS_STALL_RESET  _u(0x0)
#define USB_INTS_STALL_BITS   _u(0x00000400)
#define USB_INTS_STALL_MSB    _u(10)
#define USB_INTS_STALL_LSB    _u(10)
#define USB_INTS_STALL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_ERROR_CRC
// Description : Source: SIE_STATUS.CRC_ERROR
#define USB_INTS_ERROR_CRC_RESET  _u(0x0)
#define USB_INTS_ERROR_CRC_BITS   _u(0x00000200)
#define USB_INTS_ERROR_CRC_MSB    _u(9)
#define USB_INTS_ERROR_CRC_LSB    _u(9)
#define USB_INTS_ERROR_CRC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_ERROR_BIT_STUFF
// Description : Source: SIE_STATUS.BIT_STUFF_ERROR
#define USB_INTS_ERROR_BIT_STUFF_RESET  _u(0x0)
#define USB_INTS_ERROR_BIT_STUFF_BITS   _u(0x00000100)
#define USB_INTS_ERROR_BIT_STUFF_MSB    _u(8)
#define USB_INTS_ERROR_BIT_STUFF_LSB    _u(8)
#define USB_INTS_ERROR_BIT_STUFF_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_ERROR_RX_OVERFLOW
// Description : Source: SIE_STATUS.RX_OVERFLOW
#define USB_INTS_ERROR_RX_OVERFLOW_RESET  _u(0x0)
#define USB_INTS_ERROR_RX_OVERFLOW_BITS   _u(0x00000080)
#define USB_INTS_ERROR_RX_OVERFLOW_MSB    _u(7)
#define USB_INTS_ERROR_RX_OVERFLOW_LSB    _u(7)
#define USB_INTS_ERROR_RX_OVERFLOW_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_ERROR_RX_TIMEOUT
// Description : Source: SIE_STATUS.RX_TIMEOUT
#define USB_INTS_ERROR_RX_TIMEOUT_RESET  _u(0x0)
#define USB_INTS_ERROR_RX_TIMEOUT_BITS   _u(0x00000040)
#define USB_INTS_ERROR_RX_TIMEOUT_MSB    _u(6)
#define USB_INTS_ERROR_RX_TIMEOUT_LSB    _u(6)
#define USB_INTS_ERROR_RX_TIMEOUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_ERROR_DATA_SEQ
// Description : Source: SIE_STATUS.DATA_SEQ_ERROR
#define USB_INTS_ERROR_DATA_SEQ_RESET  _u(0x0)
#define USB_INTS_ERROR_DATA_SEQ_BITS   _u(0x00000020)
#define USB_INTS_ERROR_DATA_SEQ_MSB    _u(5)
#define USB_INTS_ERROR_DATA_SEQ_LSB    _u(5)
#define USB_INTS_ERROR_DATA_SEQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_BUFF_STATUS
// Description : Raised when any bit in BUFF_STATUS is set. Clear by clearing
//               all bits in BUFF_STATUS.
#define USB_INTS_BUFF_STATUS_RESET  _u(0x0)
#define USB_INTS_BUFF_STATUS_BITS   _u(0x00000010)
#define USB_INTS_BUFF_STATUS_MSB    _u(4)
#define USB_INTS_BUFF_STATUS_LSB    _u(4)
#define USB_INTS_BUFF_STATUS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_TRANS_COMPLETE
// Description : Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
//               writing to this bit.
#define USB_INTS_TRANS_COMPLETE_RESET  _u(0x0)
#define USB_INTS_TRANS_COMPLETE_BITS   _u(0x00000008)
#define USB_INTS_TRANS_COMPLETE_MSB    _u(3)
#define USB_INTS_TRANS_COMPLETE_LSB    _u(3)
#define USB_INTS_TRANS_COMPLETE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_HOST_SOF
// Description : Host: raised every time the host sends a SOF (Start of Frame).
//               Cleared by reading SOF_RD
#define USB_INTS_HOST_SOF_RESET  _u(0x0)
#define USB_INTS_HOST_SOF_BITS   _u(0x00000004)
#define USB_INTS_HOST_SOF_MSB    _u(2)
#define USB_INTS_HOST_SOF_LSB    _u(2)
#define USB_INTS_HOST_SOF_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_HOST_RESUME
// Description : Host: raised when a device wakes up the host. Cleared by
//               writing to SIE_STATUS.RESUME
#define USB_INTS_HOST_RESUME_RESET  _u(0x0)
#define USB_INTS_HOST_RESUME_BITS   _u(0x00000002)
#define USB_INTS_HOST_RESUME_MSB    _u(1)
#define USB_INTS_HOST_RESUME_LSB    _u(1)
#define USB_INTS_HOST_RESUME_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTS_HOST_CONN_DIS
// Description : Host: raised when a device is connected or disconnected (i.e.
//               when SIE_STATUS.SPEED changes). Cleared by writing to
//               SIE_STATUS.SPEED
#define USB_INTS_HOST_CONN_DIS_RESET  _u(0x0)
#define USB_INTS_HOST_CONN_DIS_BITS   _u(0x00000001)
#define USB_INTS_HOST_CONN_DIS_MSB    _u(0)
#define USB_INTS_HOST_CONN_DIS_LSB    _u(0)
#define USB_INTS_HOST_CONN_DIS_ACCESS "RO"
// =============================================================================
// Register    : USB_SOF_TIMESTAMP_RAW
// Description : Device only. Raw value of free-running PHY clock counter
//               @48MHz. Used to calculate time between SOF events.
#define USB_SOF_TIMESTAMP_RAW_OFFSET _u(0x00000100)
#define USB_SOF_TIMESTAMP_RAW_BITS   _u(0x001fffff)
#define USB_SOF_TIMESTAMP_RAW_RESET  _u(0x00000000)
#define USB_SOF_TIMESTAMP_RAW_MSB    _u(20)
#define USB_SOF_TIMESTAMP_RAW_LSB    _u(0)
#define USB_SOF_TIMESTAMP_RAW_ACCESS "RO"
// =============================================================================
// Register    : USB_SOF_TIMESTAMP_LAST
// Description : Device only. Value of free-running PHY clock counter @48MHz
//               when last SOF event occurred.
#define USB_SOF_TIMESTAMP_LAST_OFFSET _u(0x00000104)
#define USB_SOF_TIMESTAMP_LAST_BITS   _u(0x001fffff)
#define USB_SOF_TIMESTAMP_LAST_RESET  _u(0x00000000)
#define USB_SOF_TIMESTAMP_LAST_MSB    _u(20)
#define USB_SOF_TIMESTAMP_LAST_LSB    _u(0)
#define USB_SOF_TIMESTAMP_LAST_ACCESS "RO"
// =============================================================================
// Register    : USB_SM_STATE
#define USB_SM_STATE_OFFSET _u(0x00000108)
#define USB_SM_STATE_BITS   _u(0x00000fff)
#define USB_SM_STATE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_SM_STATE_RX_DASM
#define USB_SM_STATE_RX_DASM_RESET  _u(0x0)
#define USB_SM_STATE_RX_DASM_BITS   _u(0x00000f00)
#define USB_SM_STATE_RX_DASM_MSB    _u(11)
#define USB_SM_STATE_RX_DASM_LSB    _u(8)
#define USB_SM_STATE_RX_DASM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_SM_STATE_BC_STATE
#define USB_SM_STATE_BC_STATE_RESET  _u(0x0)
#define USB_SM_STATE_BC_STATE_BITS   _u(0x000000e0)
#define USB_SM_STATE_BC_STATE_MSB    _u(7)
#define USB_SM_STATE_BC_STATE_LSB    _u(5)
#define USB_SM_STATE_BC_STATE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_SM_STATE_STATE
#define USB_SM_STATE_STATE_RESET  _u(0x00)
#define USB_SM_STATE_STATE_BITS   _u(0x0000001f)
#define USB_SM_STATE_STATE_MSB    _u(4)
#define USB_SM_STATE_STATE_LSB    _u(0)
#define USB_SM_STATE_STATE_ACCESS "RO"
// =============================================================================
// Register    : USB_EP_TX_ERROR
// Description : TX error count for each endpoint. Write to each field to reset
//               the counter to 0.
#define USB_EP_TX_ERROR_OFFSET _u(0x0000010c)
#define USB_EP_TX_ERROR_BITS   _u(0xffffffff)
#define USB_EP_TX_ERROR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP15
#define USB_EP_TX_ERROR_EP15_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP15_BITS   _u(0xc0000000)
#define USB_EP_TX_ERROR_EP15_MSB    _u(31)
#define USB_EP_TX_ERROR_EP15_LSB    _u(30)
#define USB_EP_TX_ERROR_EP15_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP14
#define USB_EP_TX_ERROR_EP14_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP14_BITS   _u(0x30000000)
#define USB_EP_TX_ERROR_EP14_MSB    _u(29)
#define USB_EP_TX_ERROR_EP14_LSB    _u(28)
#define USB_EP_TX_ERROR_EP14_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP13
#define USB_EP_TX_ERROR_EP13_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP13_BITS   _u(0x0c000000)
#define USB_EP_TX_ERROR_EP13_MSB    _u(27)
#define USB_EP_TX_ERROR_EP13_LSB    _u(26)
#define USB_EP_TX_ERROR_EP13_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP12
#define USB_EP_TX_ERROR_EP12_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP12_BITS   _u(0x03000000)
#define USB_EP_TX_ERROR_EP12_MSB    _u(25)
#define USB_EP_TX_ERROR_EP12_LSB    _u(24)
#define USB_EP_TX_ERROR_EP12_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP11
#define USB_EP_TX_ERROR_EP11_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP11_BITS   _u(0x00c00000)
#define USB_EP_TX_ERROR_EP11_MSB    _u(23)
#define USB_EP_TX_ERROR_EP11_LSB    _u(22)
#define USB_EP_TX_ERROR_EP11_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP10
#define USB_EP_TX_ERROR_EP10_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP10_BITS   _u(0x00300000)
#define USB_EP_TX_ERROR_EP10_MSB    _u(21)
#define USB_EP_TX_ERROR_EP10_LSB    _u(20)
#define USB_EP_TX_ERROR_EP10_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP9
#define USB_EP_TX_ERROR_EP9_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP9_BITS   _u(0x000c0000)
#define USB_EP_TX_ERROR_EP9_MSB    _u(19)
#define USB_EP_TX_ERROR_EP9_LSB    _u(18)
#define USB_EP_TX_ERROR_EP9_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP8
#define USB_EP_TX_ERROR_EP8_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP8_BITS   _u(0x00030000)
#define USB_EP_TX_ERROR_EP8_MSB    _u(17)
#define USB_EP_TX_ERROR_EP8_LSB    _u(16)
#define USB_EP_TX_ERROR_EP8_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP7
#define USB_EP_TX_ERROR_EP7_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP7_BITS   _u(0x0000c000)
#define USB_EP_TX_ERROR_EP7_MSB    _u(15)
#define USB_EP_TX_ERROR_EP7_LSB    _u(14)
#define USB_EP_TX_ERROR_EP7_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP6
#define USB_EP_TX_ERROR_EP6_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP6_BITS   _u(0x00003000)
#define USB_EP_TX_ERROR_EP6_MSB    _u(13)
#define USB_EP_TX_ERROR_EP6_LSB    _u(12)
#define USB_EP_TX_ERROR_EP6_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP5
#define USB_EP_TX_ERROR_EP5_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP5_BITS   _u(0x00000c00)
#define USB_EP_TX_ERROR_EP5_MSB    _u(11)
#define USB_EP_TX_ERROR_EP5_LSB    _u(10)
#define USB_EP_TX_ERROR_EP5_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP4
#define USB_EP_TX_ERROR_EP4_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP4_BITS   _u(0x00000300)
#define USB_EP_TX_ERROR_EP4_MSB    _u(9)
#define USB_EP_TX_ERROR_EP4_LSB    _u(8)
#define USB_EP_TX_ERROR_EP4_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP3
#define USB_EP_TX_ERROR_EP3_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP3_BITS   _u(0x000000c0)
#define USB_EP_TX_ERROR_EP3_MSB    _u(7)
#define USB_EP_TX_ERROR_EP3_LSB    _u(6)
#define USB_EP_TX_ERROR_EP3_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP2
#define USB_EP_TX_ERROR_EP2_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP2_BITS   _u(0x00000030)
#define USB_EP_TX_ERROR_EP2_MSB    _u(5)
#define USB_EP_TX_ERROR_EP2_LSB    _u(4)
#define USB_EP_TX_ERROR_EP2_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP1
#define USB_EP_TX_ERROR_EP1_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP1_BITS   _u(0x0000000c)
#define USB_EP_TX_ERROR_EP1_MSB    _u(3)
#define USB_EP_TX_ERROR_EP1_LSB    _u(2)
#define USB_EP_TX_ERROR_EP1_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_TX_ERROR_EP0
#define USB_EP_TX_ERROR_EP0_RESET  _u(0x0)
#define USB_EP_TX_ERROR_EP0_BITS   _u(0x00000003)
#define USB_EP_TX_ERROR_EP0_MSB    _u(1)
#define USB_EP_TX_ERROR_EP0_LSB    _u(0)
#define USB_EP_TX_ERROR_EP0_ACCESS "WC"
// =============================================================================
// Register    : USB_EP_RX_ERROR
// Description : RX error count for each endpoint. Write to each field to reset
//               the counter to 0.
#define USB_EP_RX_ERROR_OFFSET _u(0x00000110)
#define USB_EP_RX_ERROR_BITS   _u(0xffffffff)
#define USB_EP_RX_ERROR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP15_SEQ
#define USB_EP_RX_ERROR_EP15_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP15_SEQ_BITS   _u(0x80000000)
#define USB_EP_RX_ERROR_EP15_SEQ_MSB    _u(31)
#define USB_EP_RX_ERROR_EP15_SEQ_LSB    _u(31)
#define USB_EP_RX_ERROR_EP15_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP15_TRANSACTION
#define USB_EP_RX_ERROR_EP15_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP15_TRANSACTION_BITS   _u(0x40000000)
#define USB_EP_RX_ERROR_EP15_TRANSACTION_MSB    _u(30)
#define USB_EP_RX_ERROR_EP15_TRANSACTION_LSB    _u(30)
#define USB_EP_RX_ERROR_EP15_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP14_SEQ
#define USB_EP_RX_ERROR_EP14_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP14_SEQ_BITS   _u(0x20000000)
#define USB_EP_RX_ERROR_EP14_SEQ_MSB    _u(29)
#define USB_EP_RX_ERROR_EP14_SEQ_LSB    _u(29)
#define USB_EP_RX_ERROR_EP14_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP14_TRANSACTION
#define USB_EP_RX_ERROR_EP14_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP14_TRANSACTION_BITS   _u(0x10000000)
#define USB_EP_RX_ERROR_EP14_TRANSACTION_MSB    _u(28)
#define USB_EP_RX_ERROR_EP14_TRANSACTION_LSB    _u(28)
#define USB_EP_RX_ERROR_EP14_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP13_SEQ
#define USB_EP_RX_ERROR_EP13_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP13_SEQ_BITS   _u(0x08000000)
#define USB_EP_RX_ERROR_EP13_SEQ_MSB    _u(27)
#define USB_EP_RX_ERROR_EP13_SEQ_LSB    _u(27)
#define USB_EP_RX_ERROR_EP13_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP13_TRANSACTION
#define USB_EP_RX_ERROR_EP13_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP13_TRANSACTION_BITS   _u(0x04000000)
#define USB_EP_RX_ERROR_EP13_TRANSACTION_MSB    _u(26)
#define USB_EP_RX_ERROR_EP13_TRANSACTION_LSB    _u(26)
#define USB_EP_RX_ERROR_EP13_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP12_SEQ
#define USB_EP_RX_ERROR_EP12_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP12_SEQ_BITS   _u(0x02000000)
#define USB_EP_RX_ERROR_EP12_SEQ_MSB    _u(25)
#define USB_EP_RX_ERROR_EP12_SEQ_LSB    _u(25)
#define USB_EP_RX_ERROR_EP12_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP12_TRANSACTION
#define USB_EP_RX_ERROR_EP12_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP12_TRANSACTION_BITS   _u(0x01000000)
#define USB_EP_RX_ERROR_EP12_TRANSACTION_MSB    _u(24)
#define USB_EP_RX_ERROR_EP12_TRANSACTION_LSB    _u(24)
#define USB_EP_RX_ERROR_EP12_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP11_SEQ
#define USB_EP_RX_ERROR_EP11_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP11_SEQ_BITS   _u(0x00800000)
#define USB_EP_RX_ERROR_EP11_SEQ_MSB    _u(23)
#define USB_EP_RX_ERROR_EP11_SEQ_LSB    _u(23)
#define USB_EP_RX_ERROR_EP11_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP11_TRANSACTION
#define USB_EP_RX_ERROR_EP11_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP11_TRANSACTION_BITS   _u(0x00400000)
#define USB_EP_RX_ERROR_EP11_TRANSACTION_MSB    _u(22)
#define USB_EP_RX_ERROR_EP11_TRANSACTION_LSB    _u(22)
#define USB_EP_RX_ERROR_EP11_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP10_SEQ
#define USB_EP_RX_ERROR_EP10_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP10_SEQ_BITS   _u(0x00200000)
#define USB_EP_RX_ERROR_EP10_SEQ_MSB    _u(21)
#define USB_EP_RX_ERROR_EP10_SEQ_LSB    _u(21)
#define USB_EP_RX_ERROR_EP10_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP10_TRANSACTION
#define USB_EP_RX_ERROR_EP10_TRANSACTION_RESET  _u(0x0)
