Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/usb.h
#define USB_EP_RX_ERROR_EP10_TRANSACTION_BITS   _u(0x00100000)
#define USB_EP_RX_ERROR_EP10_TRANSACTION_MSB    _u(20)
#define USB_EP_RX_ERROR_EP10_TRANSACTION_LSB    _u(20)
#define USB_EP_RX_ERROR_EP10_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP9_SEQ
#define USB_EP_RX_ERROR_EP9_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP9_SEQ_BITS   _u(0x00080000)
#define USB_EP_RX_ERROR_EP9_SEQ_MSB    _u(19)
#define USB_EP_RX_ERROR_EP9_SEQ_LSB    _u(19)
#define USB_EP_RX_ERROR_EP9_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP9_TRANSACTION
#define USB_EP_RX_ERROR_EP9_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP9_TRANSACTION_BITS   _u(0x00040000)
#define USB_EP_RX_ERROR_EP9_TRANSACTION_MSB    _u(18)
#define USB_EP_RX_ERROR_EP9_TRANSACTION_LSB    _u(18)
#define USB_EP_RX_ERROR_EP9_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP8_SEQ
#define USB_EP_RX_ERROR_EP8_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP8_SEQ_BITS   _u(0x00020000)
#define USB_EP_RX_ERROR_EP8_SEQ_MSB    _u(17)
#define USB_EP_RX_ERROR_EP8_SEQ_LSB    _u(17)
#define USB_EP_RX_ERROR_EP8_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP8_TRANSACTION
#define USB_EP_RX_ERROR_EP8_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP8_TRANSACTION_BITS   _u(0x00010000)
#define USB_EP_RX_ERROR_EP8_TRANSACTION_MSB    _u(16)
#define USB_EP_RX_ERROR_EP8_TRANSACTION_LSB    _u(16)
#define USB_EP_RX_ERROR_EP8_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP7_SEQ
#define USB_EP_RX_ERROR_EP7_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP7_SEQ_BITS   _u(0x00008000)
#define USB_EP_RX_ERROR_EP7_SEQ_MSB    _u(15)
#define USB_EP_RX_ERROR_EP7_SEQ_LSB    _u(15)
#define USB_EP_RX_ERROR_EP7_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP7_TRANSACTION
#define USB_EP_RX_ERROR_EP7_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP7_TRANSACTION_BITS   _u(0x00004000)
#define USB_EP_RX_ERROR_EP7_TRANSACTION_MSB    _u(14)
#define USB_EP_RX_ERROR_EP7_TRANSACTION_LSB    _u(14)
#define USB_EP_RX_ERROR_EP7_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP6_SEQ
#define USB_EP_RX_ERROR_EP6_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP6_SEQ_BITS   _u(0x00002000)
#define USB_EP_RX_ERROR_EP6_SEQ_MSB    _u(13)
#define USB_EP_RX_ERROR_EP6_SEQ_LSB    _u(13)
#define USB_EP_RX_ERROR_EP6_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP6_TRANSACTION
#define USB_EP_RX_ERROR_EP6_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP6_TRANSACTION_BITS   _u(0x00001000)
#define USB_EP_RX_ERROR_EP6_TRANSACTION_MSB    _u(12)
#define USB_EP_RX_ERROR_EP6_TRANSACTION_LSB    _u(12)
#define USB_EP_RX_ERROR_EP6_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP5_SEQ
#define USB_EP_RX_ERROR_EP5_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP5_SEQ_BITS   _u(0x00000800)
#define USB_EP_RX_ERROR_EP5_SEQ_MSB    _u(11)
#define USB_EP_RX_ERROR_EP5_SEQ_LSB    _u(11)
#define USB_EP_RX_ERROR_EP5_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP5_TRANSACTION
#define USB_EP_RX_ERROR_EP5_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP5_TRANSACTION_BITS   _u(0x00000400)
#define USB_EP_RX_ERROR_EP5_TRANSACTION_MSB    _u(10)
#define USB_EP_RX_ERROR_EP5_TRANSACTION_LSB    _u(10)
#define USB_EP_RX_ERROR_EP5_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP4_SEQ
#define USB_EP_RX_ERROR_EP4_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP4_SEQ_BITS   _u(0x00000200)
#define USB_EP_RX_ERROR_EP4_SEQ_MSB    _u(9)
#define USB_EP_RX_ERROR_EP4_SEQ_LSB    _u(9)
#define USB_EP_RX_ERROR_EP4_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP4_TRANSACTION
#define USB_EP_RX_ERROR_EP4_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP4_TRANSACTION_BITS   _u(0x00000100)
#define USB_EP_RX_ERROR_EP4_TRANSACTION_MSB    _u(8)
#define USB_EP_RX_ERROR_EP4_TRANSACTION_LSB    _u(8)
#define USB_EP_RX_ERROR_EP4_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP3_SEQ
#define USB_EP_RX_ERROR_EP3_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP3_SEQ_BITS   _u(0x00000080)
#define USB_EP_RX_ERROR_EP3_SEQ_MSB    _u(7)
#define USB_EP_RX_ERROR_EP3_SEQ_LSB    _u(7)
#define USB_EP_RX_ERROR_EP3_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP3_TRANSACTION
#define USB_EP_RX_ERROR_EP3_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP3_TRANSACTION_BITS   _u(0x00000040)
#define USB_EP_RX_ERROR_EP3_TRANSACTION_MSB    _u(6)
#define USB_EP_RX_ERROR_EP3_TRANSACTION_LSB    _u(6)
#define USB_EP_RX_ERROR_EP3_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP2_SEQ
#define USB_EP_RX_ERROR_EP2_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP2_SEQ_BITS   _u(0x00000020)
#define USB_EP_RX_ERROR_EP2_SEQ_MSB    _u(5)
#define USB_EP_RX_ERROR_EP2_SEQ_LSB    _u(5)
#define USB_EP_RX_ERROR_EP2_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP2_TRANSACTION
#define USB_EP_RX_ERROR_EP2_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP2_TRANSACTION_BITS   _u(0x00000010)
#define USB_EP_RX_ERROR_EP2_TRANSACTION_MSB    _u(4)
#define USB_EP_RX_ERROR_EP2_TRANSACTION_LSB    _u(4)
#define USB_EP_RX_ERROR_EP2_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP1_SEQ
#define USB_EP_RX_ERROR_EP1_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP1_SEQ_BITS   _u(0x00000008)
#define USB_EP_RX_ERROR_EP1_SEQ_MSB    _u(3)
#define USB_EP_RX_ERROR_EP1_SEQ_LSB    _u(3)
#define USB_EP_RX_ERROR_EP1_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP1_TRANSACTION
#define USB_EP_RX_ERROR_EP1_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP1_TRANSACTION_BITS   _u(0x00000004)
#define USB_EP_RX_ERROR_EP1_TRANSACTION_MSB    _u(2)
#define USB_EP_RX_ERROR_EP1_TRANSACTION_LSB    _u(2)
#define USB_EP_RX_ERROR_EP1_TRANSACTION_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP0_SEQ
#define USB_EP_RX_ERROR_EP0_SEQ_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP0_SEQ_BITS   _u(0x00000002)
#define USB_EP_RX_ERROR_EP0_SEQ_MSB    _u(1)
#define USB_EP_RX_ERROR_EP0_SEQ_LSB    _u(1)
#define USB_EP_RX_ERROR_EP0_SEQ_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_RX_ERROR_EP0_TRANSACTION
#define USB_EP_RX_ERROR_EP0_TRANSACTION_RESET  _u(0x0)
#define USB_EP_RX_ERROR_EP0_TRANSACTION_BITS   _u(0x00000001)
#define USB_EP_RX_ERROR_EP0_TRANSACTION_MSB    _u(0)
#define USB_EP_RX_ERROR_EP0_TRANSACTION_LSB    _u(0)
#define USB_EP_RX_ERROR_EP0_TRANSACTION_ACCESS "WC"
// =============================================================================
// Register    : USB_DEV_SM_WATCHDOG
// Description : Watchdog that forces the device state machine to idle and
//               raises an interrupt if the device stays in a state that isn't
//               idle for the configured limit. The counter is reset on every
//               state transition.
//               Set limit while enable is low and then set the enable.
#define USB_DEV_SM_WATCHDOG_OFFSET _u(0x00000114)
#define USB_DEV_SM_WATCHDOG_BITS   _u(0x001fffff)
#define USB_DEV_SM_WATCHDOG_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_DEV_SM_WATCHDOG_FIRED
#define USB_DEV_SM_WATCHDOG_FIRED_RESET  _u(0x0)
#define USB_DEV_SM_WATCHDOG_FIRED_BITS   _u(0x00100000)
#define USB_DEV_SM_WATCHDOG_FIRED_MSB    _u(20)
#define USB_DEV_SM_WATCHDOG_FIRED_LSB    _u(20)
#define USB_DEV_SM_WATCHDOG_FIRED_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_DEV_SM_WATCHDOG_RESET
// Description : Set to 1 to forcibly reset the device state machine on watchdog
//               expiry
#define USB_DEV_SM_WATCHDOG_RESET_RESET  _u(0x0)
#define USB_DEV_SM_WATCHDOG_RESET_BITS   _u(0x00080000)
#define USB_DEV_SM_WATCHDOG_RESET_MSB    _u(19)
#define USB_DEV_SM_WATCHDOG_RESET_LSB    _u(19)
#define USB_DEV_SM_WATCHDOG_RESET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_DEV_SM_WATCHDOG_ENABLE
#define USB_DEV_SM_WATCHDOG_ENABLE_RESET  _u(0x0)
#define USB_DEV_SM_WATCHDOG_ENABLE_BITS   _u(0x00040000)
#define USB_DEV_SM_WATCHDOG_ENABLE_MSB    _u(18)
#define USB_DEV_SM_WATCHDOG_ENABLE_LSB    _u(18)
#define USB_DEV_SM_WATCHDOG_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_DEV_SM_WATCHDOG_LIMIT
#define USB_DEV_SM_WATCHDOG_LIMIT_RESET  _u(0x00000)
#define USB_DEV_SM_WATCHDOG_LIMIT_BITS   _u(0x0003ffff)
#define USB_DEV_SM_WATCHDOG_LIMIT_MSB    _u(17)
#define USB_DEV_SM_WATCHDOG_LIMIT_LSB    _u(0)
#define USB_DEV_SM_WATCHDOG_LIMIT_ACCESS "RW"
// =============================================================================
#endif // _HARDWARE_REGS_USB_H

